u-blox/ubxlib/port/platform/stm32cube/src/u_port_os.c
/*
 * Copyright 2019-2024 u-blox
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

/** @file
 * @brief Implementation of the port OS API for the STM32F4 platform;
 * this assumes FreeRTOS, the RTOS pre-integrated by ST for STM32F4,
 * plus a little CMSIS but not all of it as CMSIS (version 1 at least)
 * is too limited.  See u_port_os_pure_cmsis.c for the implementation
 * of the OS port API for the STM32U5 platform.
 */

#ifdef U_CFG_OVERRIDE
# include "u_cfg_override.h" // For a customer's configuration override
#endif

/* The remaining include files come after the mutex debug macros. */

/* ----------------------------------------------------------------
 * COMPILE-TIME MACROS FOR MUTEX DEBUG
 * -------------------------------------------------------------- */

#ifdef U_CFG_MUTEX_DEBUG
/** If we're adding the mutex debug intermediate functions to
 * the build then the implementations of the mutex functions
 * here get an underscore before them
 */
# define MAKE_MTX_FN(x, ...) _ ## x, ##__VA_ARGS__
#else
/** The normal case: a mutex function is not fiddled with.
 */
# define MAKE_MTX_FN(x, ...) x, ##__VA_ARGS__
#endif

/** This macro, working in conjunction with the MAKE_MTX_FN()
 * macro above, should wrap all of the uPortOsMutex* functions
 * in this file.  The functions are then pre-fixed with an
 * underscore if U_CFG_MUTEX_DEBUG is defined, allowing the
 * intermediate mutex macros/functions over in u_mutex_debug.c
 * to take their place.  Those functions subsequently call
 * back into the "underscore versions" of the uPortOsMutex*
 * functions here.
 */
#define MTX_FN(x, ...) MAKE_MTX_FN(x, ##__VA_ARGS__)

// Now undef U_CFG_MUTEX_DEBUG so that this file is not polluted
// by the u_mutex_debug.h stuff brought in through u_port_os.h.
#undef U_CFG_MUTEX_DEBUG

/* ----------------------------------------------------------------
 * INCLUDE FILES
 * -------------------------------------------------------------- */

#include "stddef.h"    // NULL, size_t etc.
#include "stdint.h"    // int32_t etc.
#include "stdbool.h"
#include "stdio.h"

#include "u_cfg_sw.h"
#include "u_cfg_os_platform_specific.h"
#include "u_compiler.h" // U_ATOMIC_XXX() macros

#include "u_error_common.h"
#include "u_assert.h"
#include "u_port_debug.h"
#include "u_port.h"
#include "u_port_os.h"

#include "cmsis_os.h"
#ifdef CMSIS_V2
# include "cmsis_os2.h"
#endif

#include "FreeRTOS.h"
#include "task.h"
#include "semphr.h"
#include "queue.h"
#include "timers.h"

#ifdef STM32U575xx
# include "stm32u5xx_hal.h"
# include "stm32u5xx_hal_gpio.h"
#else
# include "stm32f4xx_hal.h"
# include "stm32f4xx_hal_gpio.h"
#endif

#include "u_port_private.h"  // Down here 'cos it needs GPIO_TypeDef

#include "newlib.h" // For __NEWLIB__

/* ----------------------------------------------------------------
 * COMPILE-TIME MACROS
 * -------------------------------------------------------------- */

/* ----------------------------------------------------------------
 * TYPES
 * -------------------------------------------------------------- */

/* ----------------------------------------------------------------
 * VARIABLES
 * -------------------------------------------------------------- */

/** Variable to keep track of OS resource usage.
 */
static volatile int32_t gResourceAllocCount = 0;

/* ----------------------------------------------------------------
 * STATIC FUNCTIONS
 * -------------------------------------------------------------- */

/* ----------------------------------------------------------------
 * PUBLIC FUNCTIONS: TASKS
 * -------------------------------------------------------------- */

// Create a task.
int32_t uPortTaskCreate(void (*pFunction)(void *),
                        const char *pName,
                        size_t stackSizeBytes,
                        void *pParameter,
                        int32_t priority,
                        uPortTaskHandle_t *pTaskHandle)
{
    uErrorCode_t errorCode = U_ERROR_COMMON_INVALID_PARAMETER;
#ifdef CMSIS_V2
    osThreadAttr_t attr = {0};
#else
    osThreadDef_t threadDef = {0};
#endif

    if ((pFunction != NULL) && (pTaskHandle != NULL) &&
        (priority >= U_CFG_OS_PRIORITY_MIN) &&
        (priority <= U_CFG_OS_PRIORITY_MAX)) {
#ifdef CMSIS_V2
        attr.name = pName;
        attr.priority = priority;
        // For the CMSIS V2 port atop FreeRTOS the stack size is in bytes
        attr.stack_size = stackSizeBytes;
        *pTaskHandle = (uPortTaskHandle_t *) osThreadNew(pFunction,
                                                         pParameter,
                                                         &attr);
#else
        threadDef.name = (char *) pName;
        threadDef.pthread = (void (*) (void const *)) pFunction;
        threadDef.tpriority = priority;
        threadDef.instances = 0;
        // Stack size is in words here, not bytes
        threadDef.stacksize = stackSizeBytes >> 2;

        *pTaskHandle = (uPortTaskHandle_t *) osThreadCreate(&threadDef,
                                                            pParameter);
#endif
        if (*pTaskHandle != NULL) {
            errorCode = U_ERROR_COMMON_SUCCESS;
            U_ATOMIC_INCREMENT(&gResourceAllocCount);
            U_PORT_OS_DEBUG_PRINT_TASK_CREATE(*pTaskHandle, pName, stackSizeBytes, priority);
        }
    }

    return (int32_t) errorCode;
}

// Delete the given task.
int32_t uPortTaskDelete(const uPortTaskHandle_t taskHandle)
{
    uErrorCode_t errorCode = U_ERROR_COMMON_PLATFORM;
    osThreadId threadId = (osThreadId) taskHandle;

    if (threadId == NULL) {
        // In the CMSIS V2 port atop FreeRTOS we have to pass a valid task ID, NULL won't work
        threadId = osThreadGetId();
    }

    // Need to call this macro before we terminate stdout
    U_PORT_OS_DEBUG_PRINT_TASK_DELETE(threadId);

    // Below is a workaround for a memory leak when using newlib built with _LITE_EXIT enabled.
    // When _LITE_EXIT is enabled the stdio streams stdout, stdin and stderr are not closed
    // when deallocating the task, resulting in memory leaks if the deleted task have been using
    // these io streams.
    // Note: The workaround below only works when a task deletes itself.
    // Note: we used to switch this code in and out based on the following conditional:
    //
    // #if defined(__NEWLIB__) && defined(_LITE_EXIT) && defined(_REENT_SMALL) &&
    //    !defined(_REENT_GLOBAL_STDIO_STREAMS) && !defined(_UNBUF_STREAM_OPT)
    //
    // However, this doesn't work for GCC ARM version 11 and later, ALL printf()'s just stop here.
    // config.h, newlib.h and reent.h are not changed between the versions, so we can only
    // surmise that newlib library is being built with a different set of WANT_ switches.
    // It would be best to switch the code in or out based on the GCC version but that doesn't
    // seem to be available in a header file.  Instead, the point at which the behaviour
    // changed was also the point at which the newlib major version changed to 4, so we
    // use that instead.
#if defined(__NEWLIB__) && (__NEWLIB__ < 4)
    if (taskHandle == NULL) {
        if (stdout) {
            fclose(stdout);
        }
        if (stderr) {
            fclose(stderr);
        }
        if (stdin) {
            fclose(stdin);
        }
    }
#endif

